Repository: AnankeChronos/woocommerce-xrp
Catalog: languages/wc-gateway-xrp-*.po
Languages: fr_be

source: Let your customers pay using the XRP Ledger.
fr_be: Permettre à vos clients de payer avec le XRP Ledger.

source: <div class="notice notice-error"><p>Your current currency is not supported yet. Please use <b>USD</b> or <b>EUR</b> with for now.</p></div>
fr_be: <div class="notice notice-error"><p>Votre devise actuelle n'est pas encore prise en charge. Veuillez utiliser <b>USD</b> ou <b>EUR</b> pour l'instant.</p></div>

source: <div class="notice notice-error"><p>Before you can use the XRP payment gateway, you <b>must</b> specify a <b>XRP Account</b> and your <b>XRPL Webhook</b> details.</p></div>
fr_be: <div class="notice notice-error"><p>Avant de pouvoir utiliser cette passerelle de paiement, vous <b>devez</b> spécifier un <b>compte XRP</b> et vos détails <b>XRPL Webhook</b>.</p></div>

source: <div class="notice notice-error"><p>The specified <b>XRP Account</b> and/or <b>XRPL Webhook</b> details are invalid. Please correct these for the <b>XRP Payment Gateway</b> to work properly.</p></div>
fr_be: <div class="notice notice-error"><p> Le compte <b>XRP spécifié</b> et/ou <b>les détails XRPL Webhook</b> ne sont pas valides. S'il vous plaît corriger ceci pour que la <b>Passerelle de Paiement XRP</b> fonctionne correctement.</p></div>

source: Enable/Disable
fr_be: Activer/Désactiver

source: Enable XRP Payments
fr_be: Activer les paiements XRP

source: Title
fr_be: Titre

source: This controls the title for the payment method the customer sees during checkout.
fr_be: Ceci contrôle le titre du moyen de paiement que le client voit lors de la commande.

source: Payment method description that the customer will see on your checkout.
fr_be: Description du mode de paiement que le client verra lors de votre commande.

source: Payment instruction will be shown once you've placed your order.
fr_be: Les instructions de paiement seront affichées une fois que vous avez passé votre commande.

source: XRP Account
fr_be: Compte XRP

source: Please specify the XRP Ledger account where your payments should be sent. This should be an account <b>YOU</b> own and should <b>NOT</b> be an exchange account, since a unique destination tag is generated for each order.
fr_be: Veuillez indiquer le compte XRP Ledger dans lequel vos paiements doivent être envoyés. Cela doit être un compte à <b> vous </b> et ne doit <b> pas </b> être un compte de plateforme d'échange, car une balise de destination unique est générée pour chaque commande.

source: Your XRP account where payments should be sent.
fr_be: Votre compte XRP où les paiements doivent être envoyés.

source: XRPL Webhook options
fr_be: Options Webhook XRPL

source: In order to create your webhook and process your payments properly, please specify your XRPL Webhooks API key. For more informations how to obtain these keys, please visit <a href="https://webhook.xrpayments.co/">https://webhook.xrpayments.co</a>.
fr_be: Pour créer votre compte Webhook et traiter correctement vos paiements, veuillez spécifier votre clé API XRPL Webhooks. Pour plus d'informations sur l'obtention de ces clés, consultez la page <a href="https://webhook.xrpayments.co/"> https://webhook.xrpayments.co </a>.

source: API Key
fr_be: Clé API

source: Your XRPL XRPayments Webhook API key.
fr_be: Votre clé d'API Webhook XRPL XRPaiements.

source: Your XRPL XRPayments Webhook API secret.
fr_be: Clé secrète de votre API Webhook XRPL XRPayments Webhook.

source: Advanced
fr_be: Avancée

source: Leave these untouched unless you really know what you're doing.
fr_be: Laissez ceci intacts sauf si vous savez vraiment ce que vous faites.

source: XRP Node
fr_be: Nœud XRP

source: Which XRP node to use when checking our balance.
fr_be: Quel nœud XRP utiliser lors de la vérification de notre balance.

source: Bypass firewall
fr_be: Contourner le pare-feu

source: Use a proxy to bypass your webservers firewall.
fr_be: Utilisez un proxy pour contourner votre pare-feu de serveurs Web.

source: Exchange
fr_be: Plateforme d' Échange

source: Which exchange to use when fetching the XRP rate.
fr_be: Quel échange utiliser lors de la récupération du prix XRP.

source: Transaction Limit
fr_be: Limite de transaction

source: The number of transactions to fetch from the ledger each time we check for new payments.
fr_be: Nombre de transactions à extraire du Ledger chaque fois que nous vérifions la présence de nouveaux paiements.

source: XRP payment details
fr_be: Détails de paiement XRP

source: Destination tag
fr_be: Étiquette de destination

source: XRP total
fr_be: Total XRP

source: XRP received
fr_be: XRP reçu

source: XRP left to pay
fr_be: XRP reste à payer

source: Order status
fr_be: Statut de la commande
